posts/podaac-l2p.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Using podaacpy to subset Level-2P satellite swath data</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Deepak Cherian">
<meta name="keywords" content="podaac, podaacpy, l2p, subset, swath, modis, aqua">
<link rel="stylesheet" href="../research-posts.css" type="text/css" />
<link href="https://fonts.googleapis.com/css?family=Fira+Sans:300,400,500" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<p class="post-subtitle"><a class="animate-link back" href="../index.html"> ← Back</a> |  Deepak Cherian | 24 Apr 2020</p>
</div>
<div id="content">
<header>
<h1 class="title">Using podaacpy to subset Level-2P satellite swath data</h1>
</header><p>
This post will quickly demonstrate how to use the awesome <code>podaacpy</code> python package to access Level-2 satellite data on PO.DAAC. Only a few datasets have been updated to include the information necessary to subset. There is a list somewhere but I cannot find it anymore.
</p>

<aside>
<p>
<code>podaacpy</code> does have a <a href="https://podaacpy.readthedocs.io/en/latest/l2ss.html">Level-2 Subsetting Service (L2SS) API</a> but I had trouble getting this to work in an efficient manner.
</p>
</aside>
<p>
The approach here is:
</p>
<ol class="org-ol">
<li>Query the server for all files in a dataset within a given bounding box;</li>
<li>Parse the server response for URLs;</li>
<li>Save those URLs to a file.</li>
<li>Use <code>xargs</code> and <code>wget</code> to download the files in parallel</li>
</ol>

<section id="outline-container-org6d4135e" class="outline-2">
<h2 id="org6d4135e"><span class="section-number-2">1</span> Preliminaries</h2>
<div class="outline-text-2" id="text-1">
<p>
First the required imports and initialize a <code>Drive</code> instance. You will need PO.DAAC credentials for this. These credentials can be specified either in <code>podaac.ini</code> or passed explicitly as done here.
Docs here: <a href="https://podaacpy.readthedocs.io/en/latest/drive.html#drive.Drive">https://podaacpy.readthedocs.io/en/latest/drive.html#drive.Drive</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> pdb
<span style="color: #859900;">import</span> podaac <span style="color: #859900;">as</span> po
<span style="color: #859900;">import</span> podaac.podaac <span style="color: #859900;">as</span> podaac
<span style="color: #859900;">import</span> podaac.podaac_utils <span style="color: #859900;">as</span> utils
<span style="color: #859900;">from</span> podaac <span style="color: #859900;">import</span> drive <span style="color: #859900;">as</span> drive
<span style="color: #859900;">import</span> tqdm
<span style="color: #859900;">import</span> warnings

<span style="color: #859900;">from</span> xml.dom <span style="color: #859900;">import</span> minidom


<span style="color: #268bd2;">d</span> = drive.Drive(<span style="color: #268bd2;">None</span>, username=YOUR_USERNAME, password=YOUR_PASSWORD)
<span style="color: #268bd2;">p</span> = podaac.Podaac()
<span style="color: #268bd2;">u</span> = utils.PodaacUtils()
</pre>
</div>
</div>
</section>

<section id="outline-container-org190a251" class="outline-2">
<h2 id="org190a251"><span class="section-number-2">2</span> Asking the server for results</h2>
<div class="outline-text-2" id="text-2">
<p>
Now we tell <code>podaacpy</code> the dataset and bounding box for the subset we want. The <code>dataset_id</code> can be found by looking for "Persistent ID" at the bottom of the PO.DAAC description page for the dataset. For example, see <a href="https://podaac.jpl.nasa.gov/dataset/MODIS_A-JPL-L2P-v2019.0">https://podaac.jpl.nasa.gov/dataset/MODIS_A-JPL-L2P-v2019.0</a>
</p>

<p>
This dictionary specifies the dataset and the space/time bounds for the subset we want.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">dataset_id is "Peristent ID" at bottom of PODAAC page</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">if bbox is specified, need the T...Z in start_time, end_time</span>
<span style="color: #268bd2;">kwargs</span> = <span style="color: #b58900;">dict</span>(
    dataset_id=<span style="color: #2aa198;">"PODAAC-GHMDA-2PJ19"</span>,  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Aqua v2019</span>
    start_time=<span style="color: #2aa198;">"2018-09-20T00:00:00Z"</span>,
    end_time=<span style="color: #2aa198;">"2018-10-01T00:00:00Z"</span>,
    bbox=<span style="color: #2aa198;">"-125.5,40,-123.5,50"</span>,
    items_per_page=<span style="color: #2aa198;">"400"</span>,  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">400 seems to be max</span>
)
</pre>
</div>

<p>
<code>p.granule_search</code> asks PO.DAAC to search for all files matching the request.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">result</span> = p.granule_search(**kwargs, start_index=<span style="color: #2aa198;">"1"</span>)

<span style="color: #859900;">try</span>:
    <span style="color: #268bd2;">doc</span> = minidom.parseString(result)

    <span style="color: #268bd2;">num_granules</span> = <span style="color: #b58900;">int</span>(
        doc.getElementsByTagName(<span style="color: #2aa198;">"opensearch:totalResults"</span>)[0].firstChild.nodeValue
    )
<span style="color: #859900;">except</span>:
    <span style="color: #859900;">raise</span> <span style="color: #b58900;">ValueError</span>(<span style="color: #2aa198;">"Decoding response failed. Printing response below..."</span>)
    <span style="color: #859900;">print</span>(result)

<span style="color: #859900;">print</span>(f<span style="color: #2aa198;">"Found {num_granules} granules."</span>)
</pre>
</div>

<p>
If all goes well this should print the total number of granules (or files) the request found.
</p>

<p>
The response from the server is in XML which can be painful to deal with (if you don't know what you're doing, like me) and looks like this: <a href="https://podaac.jpl.nasa.gov/ws/search/granule/?datasetId=PODAAC-GHMDA-2PJ19">https://podaac.jpl.nasa.gov/ws/search/granule/?datasetId=PODAAC-GHMDA-2PJ19</a>. For each file, the response contains an OPeNDAP URL which is what we want.
</p>
</div>
</section>

<section id="outline-container-org7f1d10f" class="outline-2">
<h2 id="org7f1d10f"><span class="section-number-2">3</span> Parse the xml response to find OPeNDAP URLs</h2>
<div class="outline-text-2" id="text-3">
<aside>
<p>
Other helpful utility functions can be found <a href="https://podaacpy.readthedocs.io/en/latest/utilities.html">here</a>.
</p>
</aside>
<p>
Luckily <code>podaacpy</code> has two very useful functions to deal with the xml response
</p>
<ol class="org-ol">
<li><a href="https://podaacpy.readthedocs.io/en/latest/utilities.html#podaac_utils.PodaacUtils.mine_granules_from_granule_search"><code>mine_granules_from_granule_search</code></a></li>
<li><a href="https://podaacpy.readthedocs.io/en/latest/utilities.html#podaac_utils.PodaacUtils.mine_opendap_urls_from_granule_search"><code>mine_opendap_urls_from_granule_search</code></a></li>
</ol>

<aside>
<p>
I found <a href="https://podaac.jpl.nasa.gov/forum/viewtopic.php?f=5&amp;t=964">this page</a> to also be useful.
</p>
</aside>
<p>
Now we loop through, and parse the response page by page. This is because the server will only respond with <a href="https://podaac.jpl.nasa.gov/forum/viewtopic.php?f=53&amp;t=568">one page of results at a time</a>. So we call <code>granule_search</code> in a loop and pass it a different <code>start_index</code> each time. We then generate file names and get OPeNDAP URLs.
</p>

<p>
I am only interested in nighttime passes so I added a simple function <code>filter_night</code> to pull these out based on the file name.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #268bd2;">filter_night</span>(string):
    <span style="color: #859900;">return</span> <span style="color: #2aa198;">"MODIS_A-N-"</span> <span style="color: #859900;">in</span> string


<span style="color: #268bd2;">nitems</span> = <span style="color: #b58900;">int</span>(kwargs[<span style="color: #2aa198;">"items_per_page"</span>])
<span style="color: #268bd2;">name_list</span> = []
<span style="color: #268bd2;">url_list</span> = []
<span style="color: #859900;">for</span> start <span style="color: #859900;">in</span> <span style="color: #b58900;">range</span>(1, num_granules + 1, nitems):
    <span style="color: #859900;">for</span> attempt <span style="color: #859900;">in</span> <span style="color: #b58900;">range</span>(1, 11):
        <span style="color: #859900;">print</span>(f<span style="color: #2aa198;">"{start}, {attempt}"</span>)
        <span style="color: #268bd2;">result</span> = p.granule_search(**kwargs, start_index=<span style="color: #b58900;">str</span>(start))

        <span style="color: #268bd2;">names</span> = u.mine_granules_from_granule_search(result)
        <span style="color: #268bd2;">urls</span> = u.mine_opendap_urls_from_granule_search(result)

        <span style="color: #859900;">if</span> start + <span style="color: #b58900;">len</span>(names) != num_granules:
            <span style="color: #859900;">try</span>:
                <span style="color: #859900;">assert</span> <span style="color: #b58900;">len</span>(names) == nitems
                <span style="color: #859900;">assert</span> <span style="color: #b58900;">len</span>(urls) == nitems
            <span style="color: #859900;">except</span> <span style="color: #b58900;">AssertionError</span>:
                <span style="color: #859900;">print</span>(
                    f<span style="color: #2aa198;">"\n{len(names)} &lt; {nitems} items returned. retrying attempt {attempt}..."</span>
                )
            <span style="color: #859900;">else</span>:
                <span style="color: #859900;">break</span>
        <span style="color: #859900;">else</span>:
            <span style="color: #859900;">break</span>
    <span style="color: #859900;">else</span>:
        warnings.warn(<span style="color: #2aa198;">"Invalid data returned. even after 10 attempts."</span>, <span style="color: #b58900;">UserWarning</span>)
        pdb.set_trace()

    <span style="color: #268bd2;">names</span> = <span style="color: #b58900;">list</span>(<span style="color: #b58900;">filter</span>(filter_night, names))
    <span style="color: #268bd2;">urls</span> = <span style="color: #b58900;">list</span>(<span style="color: #b58900;">filter</span>(filter_night, urls))

    <span style="color: #268bd2;">name_list</span> += names
    <span style="color: #268bd2;">url_list</span> += urls
</pre>
</div>


<p>
Now we have a list of file names <code>name_list</code> and a list of URLs <code>url_list</code>. We build a download command from these two and write that to a text file. Note that we can subset the file to keep the variables we want at this point. I found it useful to actually open one of the OPeNDAP URLs in a browser and click around to figure out what variables are available.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #268bd2;">make_wget_str</span>(url, name):
    <span style="color: #2aa198;">""" chooses netCDF4 and subsets to needed variables."""</span>
    <span style="color: #859900;">return</span> (
        f<span style="color: #2aa198;">"{url[:-5]}.nc4?lat,lon,time,sea_surface_temperature,quality_level,l2p_flags"</span>
        f<span style="color: #2aa198;">" -O 'modis/{name}'"</span>
    )


<span style="color: #859900;">with</span> <span style="color: #b58900;">open</span>(<span style="color: #2aa198;">"url-list.txt"</span>, <span style="color: #2aa198;">"w"</span>) <span style="color: #859900;">as</span> f:
    f.write(<span style="color: #2aa198;">"\n"</span>.join(<span style="color: #b58900;">map</span>(make_wget_str, <span style="color: #b58900;">sorted</span>(url_list), <span style="color: #b58900;">sorted</span>(name_list))))
</pre>
</div>
</div>
</section>

<section id="outline-container-org47ff24f" class="outline-2">
<h2 id="org47ff24f"><span class="section-number-2">4</span> Download!</h2>
<div class="outline-text-2" id="text-4">
<p>
Finally we can download the URLs in this file in parallel using this <code>xargs</code> command. <code>-P 4</code> specified 4 parallel processes.
</p>

<pre class="example">
xargs -P 4 --replace --verbose --arg-file=url-list.txt /bin/sh -c "wget {}"
</pre>

<p>
Each line is read and inserted at the location of <code>{}</code> so there is one <code>wget</code> command per line in <code>url-list.txt</code>.
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<svg style="position: absolute; width: 0; height: 0; overflow: hidden;" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
<defs>

<symbol id="icon-cc-by" viewBox="0 0 91 32">
  <title>Creative Commons Attribution License</title>
  <desc>Creative Commons Attribution License</desc>
<path fill="#aab2ab" style="fill: var(--color1, #aab2ab)" d="M2.392 0.387l86.365 0.153c1.207 0 2.285-0.179 2.285 2.408l-0.106 28.441h-90.723v-28.547c0-1.276 0.123-2.456 2.179-2.456z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M89.716 0h-88.004c-0.944 0-1.712 0.768-1.712 1.712v29.902c0 0.213 0.173 0.386 0.387 0.386h90.655c0.213 0 0.387-0.173 0.387-0.386v-29.902c0-0.944-0.768-1.712-1.713-1.712zM1.712 0.773h88.004c0.518 0 0.939 0.421 0.939 0.938 0 0 0 12.074 0 20.782h-63.105c-2.305 4.168-6.747 6.999-11.845 6.999-5.1 0-9.54-2.828-11.845-6.999h-3.087c0-8.708 0-20.782 0-20.782 0-0.518 0.421-0.938 0.939-0.938z"></path>
<path fill="#fff" style="fill: var(--color3, #fff)" d="M56.235 24.95c0.24 0 0.46 0.021 0.659 0.064s0.367 0.112 0.509 0.209c0.141 0.096 0.251 0.225 0.329 0.384s0.117 0.358 0.117 0.594c0 0.254-0.058 0.466-0.174 0.635s-0.287 0.308-0.513 0.417c0.312 0.089 0.545 0.246 0.699 0.47s0.231 0.494 0.231 0.81c0 0.254-0.050 0.475-0.149 0.661s-0.233 0.338-0.4 0.455c-0.168 0.118-0.359 0.206-0.574 0.262s-0.436 0.085-0.663 0.085h-2.45v-5.045h2.379zM56.093 26.991c0.198 0 0.361-0.047 0.489-0.141s0.191-0.246 0.191-0.458c0-0.118-0.021-0.214-0.064-0.289s-0.099-0.134-0.17-0.177c-0.071-0.042-0.152-0.072-0.244-0.088s-0.188-0.024-0.286-0.024h-1.040v1.177h1.125zM56.158 29.132c0.109 0 0.212-0.010 0.311-0.032s0.186-0.057 0.263-0.106c0.075-0.050 0.135-0.117 0.18-0.202s0.067-0.193 0.067-0.325c0-0.259-0.073-0.444-0.22-0.555s-0.34-0.166-0.58-0.166h-1.211v1.384h1.19z"></path>
<path fill="#fff" style="fill: var(--color3, #fff)" d="M58.288 24.95h1.244l1.182 1.993 1.174-1.993h1.237l-1.873 3.109v1.936h-1.112v-1.964l-1.852-3.081z"></path>
<path fill="#fff" style="fill: var(--color3, #fff)" d="M26.098 14.938c0.004 5.737-4.645 10.39-10.382 10.394s-10.391-4.644-10.395-10.381c0-0.004 0-0.008 0-0.013-0.003-5.737 4.645-10.39 10.382-10.393s10.391 4.644 10.395 10.381c0 0.004 0 0.008 0 0.012z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M24.155 6.477c2.304 2.303 3.456 5.124 3.456 8.461s-1.132 6.128-3.396 8.372c-2.403 2.364-5.242 3.545-8.519 3.545-3.237 0-6.028-1.172-8.371-3.516s-3.515-5.144-3.515-8.401c0-3.257 1.172-6.077 3.515-8.461 2.284-2.304 5.074-3.456 8.371-3.456 3.337 0 6.156 1.152 8.46 3.456zM8.875 8.027c-1.948 1.967-2.921 4.271-2.921 6.914s0.964 4.927 2.891 6.854c1.928 1.927 4.222 2.891 6.885 2.891s4.977-0.973 6.944-2.92c1.868-1.808 2.802-4.082 2.802-6.825 0-2.721-0.949-5.032-2.847-6.929s-4.197-2.846-6.899-2.846-4.988 0.954-6.855 2.861zM14 13.779c-0.298-0.649-0.743-0.973-1.337-0.973-1.050 0-1.575 0.707-1.575 2.121s0.525 2.12 1.575 2.12c0.694 0 1.189-0.344 1.486-1.034l1.456 0.775c-0.694 1.233-1.735 1.849-3.123 1.849-1.071 0-1.928-0.328-2.572-0.984-0.645-0.657-0.967-1.561-0.967-2.715 0-1.133 0.332-2.033 0.996-2.7s1.492-1 2.484-1c1.467 0 2.518 0.578 3.153 1.733l-1.576 0.807zM20.85 13.779c-0.298-0.649-0.735-0.973-1.31-0.973-1.071 0-1.607 0.707-1.607 2.121s0.536 2.12 1.608 2.12c0.695 0 1.181-0.344 1.459-1.034l1.488 0.775c-0.693 1.233-1.732 1.849-3.118 1.849-1.069 0-1.925-0.328-2.569-0.984-0.643-0.657-0.965-1.561-0.965-2.715 0-1.133 0.327-2.033 0.98-2.7s1.484-1 2.494-1c1.465 0 2.514 0.578 3.147 1.733l-1.607 0.807z"></path>
<path fill="#fff" style="fill: var(--color3, #fff)" d="M66.291 11.594c0 4.519-3.663 8.181-8.182 8.181s-8.182-3.663-8.182-8.181c0-4.519 3.663-8.181 8.182-8.181s8.182 3.663 8.182 8.181z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M60.476 9.227c0-0.315-0.256-0.571-0.57-0.571h-3.614c-0.314 0-0.57 0.255-0.57 0.571v3.614h1.008v4.279h2.739v-4.279h1.008v-3.614z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M59.335 6.944c0 0.683-0.553 1.236-1.236 1.236s-1.236-0.553-1.236-1.236c0-0.683 0.553-1.236 1.236-1.236s1.236 0.553 1.236 1.236z"></path>
<path fill="#000" style="fill: var(--color2, #000)" d="M58.088 2.58c-2.447 0-4.519 0.854-6.215 2.562-1.74 1.767-2.609 3.858-2.609 6.272s0.87 4.491 2.609 6.228c1.74 1.737 3.812 2.606 6.215 2.606 2.433 0 4.541-0.875 6.325-2.628 1.681-1.663 2.521-3.732 2.521-6.206s-0.856-4.564-2.565-6.272c-1.711-1.708-3.804-2.562-6.281-2.562zM58.11 4.169c2.005 0 3.708 0.707 5.109 2.121 1.415 1.398 2.123 3.106 2.123 5.124 0 2.032-0.693 3.718-2.078 5.057-1.46 1.443-3.177 2.164-5.153 2.164s-3.679-0.714-5.109-2.142c-1.431-1.428-2.145-3.122-2.145-5.080s0.722-3.666 2.167-5.124c1.386-1.414 3.081-2.121 5.086-2.121z"></path>
</symbol>

</defs>
</svg>

<div align="center">
  <a rel="license" class="cc-logo" href="http://creativecommons.org/licenses/by/4.0/">
    <svg class="cc-logo"><use xlink:href="#icon-cc-by"></use></svg></a><br />This work is licensed under a <a rel="license"  href="http://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 International License</a>.
</div>
</div>
</body>
</html>
